; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v4 - type_3 ?v5 - type_1)
 	      (pred_4 ?v8 - object ?v5 - type_1)
	      (pred_2 ?v4 - type_3 ?v6 - type_2)
	      (pred_1 ?v4 - type_3 ?v8 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v4 - type_3 ?v1 ?v2 - type_1)
       :precondition (and  (pred_3 ?v4 ?v1))
       :effect (and  (pred_3 ?v4 ?v2)
		     (not (pred_3 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_3 ?v7 - object ?v3 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v3) (pred_3 ?v4 ?v3) (pred_2 ?v4 ?v6))
       :effect (and (pred_1 ?v4 ?v7 ?v6)
		    (not (pred_4 ?v7 ?v3)) 
		    (not (pred_2 ?v4 ?v6))))

   (:action op_1
       :parameters (?v4 - type_3 ?v7 - object ?v3 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v6) (pred_3 ?v4 ?v3))
       :effect (and (pred_4 ?v7 ?v3)
		    (pred_2 ?v4 ?v6)
		    (not (pred_1 ?v4 ?v7 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_05 - type_3
obj_04 obj_02 obj_07 obj_01 - type_2
obj_10 obj_11 obj_12 - type_1
obj_09 obj_06 obj_03 - object)
(:init
(pred_3 obj_08 obj_10)
(pred_2 obj_08 obj_04)
(pred_2 obj_08 obj_02)
(pred_3 obj_05 obj_10)
(pred_2 obj_05 obj_07)
(pred_2 obj_05 obj_01)
(pred_4 obj_09 obj_11)
(pred_4 obj_06 obj_10)
(pred_4 obj_03 obj_11)
)
(:goal
(and
(pred_4 obj_09 obj_11)
(pred_4 obj_06 obj_10)
(pred_4 obj_03 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_12)))
)
)

; plan
1. (op_2 obj_08 obj_10 obj_11)
   deleted: (pred_3 obj_08 obj_10)
   added: (pred_3 obj_08 obj_11)
   goals met: 2 of 3
2. (op_2 obj_05 obj_10 obj_11)
   deleted: (pred_3 obj_05 obj_10)
   added: (pred_3 obj_05 obj_11)
   goals met: 2 of 3
3. (op_3 obj_05 obj_03 obj_11 obj_01)
   deleted: (pred_4 obj_03 obj_11) (pred_2 obj_05 obj_01)
   added: (pred_1 obj_05 obj_03 obj_01)
   goals met: 2 of 3
4. (op_2 obj_05 obj_11 obj_12)
   deleted: (pred_3 obj_05 obj_11)
   added: (pred_3 obj_05 obj_12)
   goals met: 2 of 3
5. (op_1 obj_05 obj_03 obj_12 obj_01)
   deleted: (pred_1 obj_05 obj_03 obj_01)
   added: (pred_4 obj_03 obj_12) (pred_2 obj_05 obj_01)
   goals met: 3 of 3
